# IdeaStatiCa.RcsApi.Model.MemoryStream

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**CanRead** | **bool** |  | [optional] [readonly]
**CanSeek** | **bool** |  | [optional] [readonly]
**CanWrite** | **bool** |  | [optional] [readonly]
**Capacity** | **int** |  | [optional]
**Length** | **long** |  | [optional] [readonly]
**Position** | **long** |  | [optional]
**CanTimeout** | **bool** |  | [optional] [readonly]
**ReadTimeout** | **int** |  | [optional]
**WriteTimeout** | **int** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)